# pandas 실습

sr2 = pd.Series([-3, 8, 10, -2, 7], index=['a', 'b', 'c', 'd', 'e'])

data = {"names": ["sunyoung", "sunyoung", "sunyoung", "jungjae", "jungjae"],
        "year": [2016, 2017, 2018, 2015, 2016],
        "points": [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)


df2 = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                          index=["one", "two", "three", "four", "five"])

In [2]:
import numpy as np
import pandas as pd

In [3]:
sr1 = pd.Series([10, -9, 8, 7, 3, 8, -9])
sr1

0    10
1    -9
2     8
3     7
4     3
5     8
6    -9
dtype: int64

In [4]:
type(sr1)

pandas.core.series.Series

In [5]:
sr1.values

array([10, -9,  8,  7,  3,  8, -9])

In [6]:
sr1.value_counts()

 8     2
-9     2
 7     1
 3     1
 10    1
dtype: int64

In [7]:
sr1.dtype

dtype('int64')

In [8]:
sr2 = pd.Series([10, -9, 8, 7, 3, 8, -9], index=['a','b','c','d','e','f','g'])
sr2

a    10
b    -9
c     8
d     7
e     3
f     8
g    -9
dtype: int64

In [9]:
sd = {'mol': 1000000, 'pay': 100000, 'sun': 12345, 'ali': 12352343}

In [10]:
type(sd)

dict

In [11]:
sr3 = pd.Series(sd)
sr3

mol     1000000
pay      100000
sun       12345
ali    12352343
dtype: int64

In [12]:
type(sr3)

pandas.core.series.Series

In [13]:
sr3.name = '월급'

In [14]:
sr3.index.name = '이름'

In [15]:
sr3

이름
mol     1000000
pay      100000
sun       12345
ali    12352343
Name: 월급, dtype: int64

In [16]:
data = {"names": ["sunyoung", "sunyoung", "sunyoung", "jungjae", "jungjae"], 
        "year": [2016, 2017, 2018, 2015, 2016],
        "points": [1.5, 1.7, 3.6, 2.4, 2.9]}

In [17]:
df = pd.DataFrame(data)

In [18]:
df

      names  year  points
0  sunyoung  2016     1.5
1  sunyoung  2017     1.7
2  sunyoung  2018     3.6
3   jungjae  2015     2.4
4   jungjae  2016     2.9

In [19]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
df.columns

Index(['names', 'year', 'points'], dtype='object')

In [21]:
df.values

array([['sunyoung', 2016, 1.5],
       ['sunyoung', 2017, 1.7],
       ['sunyoung', 2018, 3.6],
       ['jungjae', 2015, 2.4],
       ['jungjae', 2016, 2.9]], dtype=object)

In [22]:
df2 = pd.DataFrame(data,
                   columns=["year", "names", "points", "penalty"],
                   index=["one", "two", "three", "four", "five"])

In [23]:
df2

       year     names  points penalty
one    2016  sunyoung     1.5     NaN
two    2017  sunyoung     1.7     NaN
three  2018  sunyoung     3.6     NaN
four   2015   jungjae     2.4     NaN
five   2016   jungjae     2.9     NaN

In [24]:
df2.columns

Index(['year', 'names', 'points', 'penalty'], dtype='object')

In [25]:
df2.describe()

              year    points
count     5.000000  5.000000
mean   2016.400000  2.420000
std       1.140175  0.864292
min    2015.000000  1.500000
25%    2016.000000  1.700000
50%    2016.000000  2.400000
75%    2017.000000  2.900000
max    2018.000000  3.600000

In [26]:
df2

       year     names  points penalty
one    2016  sunyoung     1.5     NaN
two    2017  sunyoung     1.7     NaN
three  2018  sunyoung     3.6     NaN
four   2015   jungjae     2.4     NaN
five   2016   jungjae     2.9     NaN

In [27]:
df2.describe?

In [28]:
df2.describe(include=[np.object])

           names  penalty
count          5      0.0
unique         2      0.0
top     sunyoung      NaN
freq           3      NaN

# column 값 얻기
- df[컬럼명]
- df[[컬럼명1,컬럼명2,...]] 

#### Error 발생
- df[컬럼명:컬럼명]

#  row 값 얻기
- df[행이름:행이름]
- df[행번호:행번호]

#### Error 발생
- df[행이름]
- df[[행이름2, 행이름2, ...]]

# loc (location)
- df.loc[행이름, 열이름]
- df.loc[[행이름1, 행이름2, ...], [열이름1, 열이름2, ...]]
- df.loc[행이름1:행이름10, 열이름1:열이름10]

# iloc (integer location)
- df.iloc[행번호, 열번호]
- df.iloc[[행번호1, 행번호2,...], [열번호1, 열번호2,...]]
- df.iloc[행번호:행번호, 열번호:열번호]
    - 범위 인덱스에서 마지막 번호는 exclusive 됨.

# del df[컬럼명]

sr2 = pd.Series([-3, 8, 10, -2, 7], index=['a', 'b', 'c', 'd', 'e'])

data = {"names": ["sunyoung", "sunyoung", "sunyoung", "jungjae", "jungjae"],
         "year": [2016, 2017, 2018, 2015, 2016],
         "points": [1.5, 1.7, 3.6, 2.4, 2.9]}

df = pd.DataFrame(data)

df2 = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
        index=["one", "two", "three", "four", "five"])

In [83]:
sr2 = pd.Series([-3, 8, 10, -2, 7], index=['a', 'b', 'c', 'd', 'e'])

In [84]:
data = {"names": ["sunyoung", "sunyoung", "sunyoung", "jungjae", "jungjae"], "year": [2016, 2017, 2018, 2015, 2016], "points": [1.5, 1.7, 3.6, 2.4, 2.9]}

In [85]:
df = pd.DataFrame(data)

In [86]:
df

      names  year  points
0  sunyoung  2016     1.5
1  sunyoung  2017     1.7
2  sunyoung  2018     3.6
3   jungjae  2015     2.4
4   jungjae  2016     2.9

In [87]:
df['penalty'] = 0.0

In [88]:
df

      names  year  points  penalty
0  sunyoung  2016     1.5      0.0
1  sunyoung  2017     1.7      0.0
2  sunyoung  2018     3.6      0.0
3   jungjae  2015     2.4      0.0
4   jungjae  2016     2.9      0.0

In [89]:
df.penalty = [0.1, 0.2, 0.5, 0.88, 0.05]
df

      names  year  points  penalty
0  sunyoung  2016     1.5     0.10
1  sunyoung  2017     1.7     0.20
2  sunyoung  2018     3.6     0.50
3   jungjae  2015     2.4     0.88
4   jungjae  2016     2.9     0.05

In [90]:
df['rank'] = np.arange(5)
df

      names  year  points  penalty  rank
0  sunyoung  2016     1.5     0.10     0
1  sunyoung  2017     1.7     0.20     1
2  sunyoung  2018     3.6     0.50     2
3   jungjae  2015     2.4     0.88     3
4   jungjae  2016     2.9     0.05     4

In [91]:
del df['rank']

In [92]:
df

      names  year  points  penalty
0  sunyoung  2016     1.5     0.10
1  sunyoung  2017     1.7     0.20
2  sunyoung  2018     3.6     0.50
3   jungjae  2015     2.4     0.88
4   jungjae  2016     2.9     0.05

In [93]:
df['num'] = np.arange(5)

In [94]:
df

      names  year  points  penalty  num
0  sunyoung  2016     1.5     0.10    0
1  sunyoung  2017     1.7     0.20    1
2  sunyoung  2018     3.6     0.50    2
3   jungjae  2015     2.4     0.88    3
4   jungjae  2016     2.9     0.05    4

In [95]:
val = pd.Series([-1.2,-1.5], index=[0, 3])

In [96]:
df['debt'] = val
df

      names  year  points  penalty  num  debt
0  sunyoung  2016     1.5     0.10    0  -1.2
1  sunyoung  2017     1.7     0.20    1   NaN
2  sunyoung  2018     3.6     0.50    2   NaN
3   jungjae  2015     2.4     0.88    3  -1.5
4   jungjae  2016     2.9     0.05    4   NaN

In [97]:
df['net_points'] = df['points'] - df['penalty']
df

      names  year  points  penalty  num  debt  net_points
0  sunyoung  2016     1.5     0.10    0  -1.2        1.40
1  sunyoung  2017     1.7     0.20    1   NaN        1.50
2  sunyoung  2018     3.6     0.50    2   NaN        3.10
3   jungjae  2015     2.4     0.88    3  -1.5        1.52
4   jungjae  2016     2.9     0.05    4   NaN        2.85

In [98]:
df['high_points'] = df['net_points'] > 3.0
df

      names  year  points  penalty  num  debt  net_points  high_points
0  sunyoung  2016     1.5     0.10    0  -1.2        1.40        False
1  sunyoung  2017     1.7     0.20    1   NaN        1.50        False
2  sunyoung  2018     3.6     0.50    2   NaN        3.10         True
3   jungjae  2015     2.4     0.88    3  -1.5        1.52        False
4   jungjae  2016     2.9     0.05    4   NaN        2.85        False

In [99]:
df['penalty'].isnull().any()

False

In [100]:
df.loc[1:3]

      names  year  points  penalty  num  debt  net_points  high_points
1  sunyoung  2017     1.7     0.20    1   NaN        1.50        False
2  sunyoung  2018     3.6     0.50    2   NaN        3.10         True
3   jungjae  2015     2.4     0.88    3  -1.5        1.52        False

In [101]:
df.loc[1:3, 'points']

1    1.7
2    3.6
3    2.4
Name: points, dtype: float64

In [102]:
df.loc[1:3, ['points','net_points']]

   points  net_points
1     1.7        1.50
2     3.6        3.10
3     2.4        1.52

In [103]:
df.iloc[1:3, 0:2]

      names  year
1  sunyoung  2017
2  sunyoung  2018

In [104]:
df

      names  year  points  penalty  num  debt  net_points  high_points
0  sunyoung  2016     1.5     0.10    0  -1.2        1.40        False
1  sunyoung  2017     1.7     0.20    1   NaN        1.50        False
2  sunyoung  2018     3.6     0.50    2   NaN        3.10         True
3   jungjae  2015     2.4     0.88    3  -1.5        1.52        False
4   jungjae  2016     2.9     0.05    4   NaN        2.85        False

In [106]:
df['year'] = df['year'].astype('int32')
df

      names  year  points  penalty  num  debt  net_points  high_points
0  sunyoung  2016     1.5     0.10    0  -1.2        1.40        False
1  sunyoung  2017     1.7     0.20    1   NaN        1.50        False
2  sunyoung  2018     3.6     0.50    2   NaN        3.10         True
3   jungjae  2015     2.4     0.88    3  -1.5        1.52        False
4   jungjae  2016     2.9     0.05    4   NaN        2.85        False

In [107]:
df.iloc[1:, 0:2]

      names  year
1  sunyoung  2017
2  sunyoung  2018
3   jungjae  2015
4   jungjae  2016

In [108]:
print(pd.__version__)

0.24.2

In [109]:
df.iloc[3:5, 0:2]

     names  year
3  jungjae  2015
4  jungjae  2016

In [110]:
df[df['year'] > 2017]

      names  year  points  penalty  num  debt  net_points  high_points
2  sunyoung  2018     3.6      0.5    2   NaN         3.1         True

In [111]:
df.loc[df['year']>2017, :]

      names  year  points  penalty  num  debt  net_points  high_points
2  sunyoung  2018     3.6      0.5    2   NaN         3.1         True

In [112]:
df

      names  year  points  penalty  num  debt  net_points  high_points
0  sunyoung  2016     1.5     0.10    0  -1.2        1.40        False
1  sunyoung  2017     1.7     0.20    1   NaN        1.50        False
2  sunyoung  2018     3.6     0.50    2   NaN        3.10         True
3   jungjae  2015     2.4     0.88    3  -1.5        1.52        False
4   jungjae  2016     2.9     0.05    4   NaN        2.85        False

In [123]:
df.loc[df['names'] == 'sunyoung', ['debt', 'net_points']]

   debt  net_points
0  -1.2         1.4
1   NaN         1.5
2   NaN         3.1

In [124]:
df.loc[df['debt'] == np.nan, :]

Empty DataFrame
Columns: [names, year, points, penalty, num, debt, net_points, high_points]
Index: []

# Drop을 이용해서 row, column 삭제하기

In [125]:
df = pd.DataFrame(np.random.randn(5,4))
df

          0         1         2         3
0 -0.550668 -0.866727 -1.462666 -2.471370
1 -1.765778  0.668155  0.706343  0.008618
2 -1.340225 -1.149792  0.626507 -0.522929
3 -0.610847 -0.834658 -0.130457  0.050691
4  0.149933  0.397498 -0.616905  0.675089

In [126]:
df.columns = ['A', 'B', 'C', 'D']
df

          A         B         C         D
0 -0.550668 -0.866727 -1.462666 -2.471370
1 -1.765778  0.668155  0.706343  0.008618
2 -1.340225 -1.149792  0.626507 -0.522929
3 -0.610847 -0.834658 -0.130457  0.050691
4  0.149933  0.397498 -0.616905  0.675089

In [129]:
df.index = pd.date_range('20180603', periods=5)
df

                   A         B         C         D
2018-06-03 -0.550668 -0.866727 -1.462666 -2.471370
2018-06-04 -1.765778  0.668155  0.706343  0.008618
2018-06-05 -1.340225 -1.149792  0.626507 -0.522929
2018-06-06 -0.610847 -0.834658 -0.130457  0.050691
2018-06-07  0.149933  0.397498 -0.616905  0.675089

In [130]:
df.index.dtype

dtype('<M8[ns]')

In [131]:
df['E'] = [10, 9, 8, 7, 6]

In [132]:
df

                   A         B         C         D   E
2018-06-03 -0.550668 -0.866727 -1.462666 -2.471370  10
2018-06-04 -1.765778  0.668155  0.706343  0.008618   9
2018-06-05 -1.340225 -1.149792  0.626507 -0.522929   8
2018-06-06 -0.610847 -0.834658 -0.130457  0.050691   7
2018-06-07  0.149933  0.397498 -0.616905  0.675089   6

In [133]:
df['F'] = [-0.10112, np.nan, 0.34243, np.nan, np.nan]
df

                   A         B         C         D   E        F
2018-06-03 -0.550668 -0.866727 -1.462666 -2.471370  10 -0.10112
2018-06-04 -1.765778  0.668155  0.706343  0.008618   9      NaN
2018-06-05 -1.340225 -1.149792  0.626507 -0.522929   8  0.34243
2018-06-06 -0.610847 -0.834658 -0.130457  0.050691   7      NaN
2018-06-07  0.149933  0.397498 -0.616905  0.675089   6      NaN

In [134]:
df.dropna?

In [140]:
df.dropna(axis=1, how='any')

                   A         B         C         D   E
2018-06-03 -0.550668 -0.866727 -1.462666 -2.471370  10
2018-06-04 -1.765778  0.668155  0.706343  0.008618   9
2018-06-05 -1.340225 -1.149792  0.626507 -0.522929   8
2018-06-06 -0.610847 -0.834658 -0.130457  0.050691   7
2018-06-07  0.149933  0.397498 -0.616905  0.675089   6

In [141]:
df

                   A         B         C         D   E        F
2018-06-03 -0.550668 -0.866727 -1.462666 -2.471370  10 -0.10112
2018-06-04 -1.765778  0.668155  0.706343  0.008618   9      NaN
2018-06-05 -1.340225 -1.149792  0.626507 -0.522929   8  0.34243
2018-06-06 -0.610847 -0.834658 -0.130457  0.050691   7      NaN
2018-06-07  0.149933  0.397498 -0.616905  0.675089   6      NaN

In [142]:
df.dropna(how='all')

                   A         B         C         D   E        F
2018-06-03 -0.550668 -0.866727 -1.462666 -2.471370  10 -0.10112
2018-06-04 -1.765778  0.668155  0.706343  0.008618   9      NaN
2018-06-05 -1.340225 -1.149792  0.626507 -0.522929   8  0.34243
2018-06-06 -0.610847 -0.834658 -0.130457  0.050691   7      NaN
2018-06-07  0.149933  0.397498 -0.616905  0.675089   6      NaN

In [146]:
df.isnull()

                A      B      C      D      E      F
2018-06-03  False  False  False  False  False  False
2018-06-04  False  False  False  False  False   True
2018-06-05  False  False  False  False  False  False
2018-06-06  False  False  False  False  False   True
2018-06-07  False  False  False  False  False   True

In [147]:
df.fillna(value=0.0, inplace=True)
df

                   A         B         C         D   E        F
2018-06-03 -0.550668 -0.866727 -1.462666 -2.471370  10 -0.10112
2018-06-04 -1.765778  0.668155  0.706343  0.008618   9  0.00000
2018-06-05 -1.340225 -1.149792  0.626507 -0.522929   8  0.34243
2018-06-06 -0.610847 -0.834658 -0.130457  0.050691   7  0.00000
2018-06-07  0.149933  0.397498 -0.616905  0.675089   6  0.00000

In [148]:
pd.to_datetime('20190630')

Timestamp('2019-06-30 00:00:00')

In [151]:
df.drop(pd.to_datetime('20180607'))

                   A         B         C         D   E        F
2018-06-03 -0.550668 -0.866727 -1.462666 -2.471370  10 -0.10112
2018-06-04 -1.765778  0.668155  0.706343  0.008618   9  0.00000
2018-06-05 -1.340225 -1.149792  0.626507 -0.522929   8  0.34243
2018-06-06 -0.610847 -0.834658 -0.130457  0.050691   7  0.00000

In [153]:
df.drop([pd.to_datetime('20180604'), pd.to_datetime('20180607')])

                   A         B         C         D   E        F
2018-06-03 -0.550668 -0.866727 -1.462666 -2.471370  10 -0.10112
2018-06-05 -1.340225 -1.149792  0.626507 -0.522929   8  0.34243
2018-06-06 -0.610847 -0.834658 -0.130457  0.050691   7  0.00000

In [155]:
# 범위로 삭제할 수는 없음.
df.drop(pd.to_datetime('20180604'): pd.to_datetime('20180607'))

SyntaxError: invalid syntax (<ipython-input-155-74c89d609070>, line 2)

In [156]:
df.drop('E', axis=1)

                   A         B         C         D        F
2018-06-03 -0.550668 -0.866727 -1.462666 -2.471370 -0.10112
2018-06-04 -1.765778  0.668155  0.706343  0.008618  0.00000
2018-06-05 -1.340225 -1.149792  0.626507 -0.522929  0.34243
2018-06-06 -0.610847 -0.834658 -0.130457  0.050691  0.00000
2018-06-07  0.149933  0.397498 -0.616905  0.675089  0.00000

In [157]:
df.drop(['A','B'], axis=1)

                   C         D   E        F
2018-06-03 -1.462666 -2.471370  10 -0.10112
2018-06-04  0.706343  0.008618   9  0.00000
2018-06-05  0.626507 -0.522929   8  0.34243
2018-06-06 -0.130457  0.050691   7  0.00000
2018-06-07 -0.616905  0.675089   6  0.00000

In [160]:
type(df.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [161]:
df.drop(df.index[2])

                   A         B         C         D   E        F
2018-06-03 -0.550668 -0.866727 -1.462666 -2.471370  10 -0.10112
2018-06-04 -1.765778  0.668155  0.706343  0.008618   9  0.00000
2018-06-06 -0.610847 -0.834658 -0.130457  0.050691   7  0.00000
2018-06-07  0.149933  0.397498 -0.616905  0.675089   6  0.00000

In [162]:
df.drop(df.index[2:4])

                   A         B         C         D   E        F
2018-06-03 -0.550668 -0.866727 -1.462666 -2.471370  10 -0.10112
2018-06-04 -1.765778  0.668155  0.706343  0.008618   9  0.00000
2018-06-07  0.149933  0.397498 -0.616905  0.675089   6  0.00000